{
  "Qing_vs_Dzungar_Khanate": {
    "alternate_names": ["Qing-Dzungar Wars", "The Dzungar Genocide", "Qing Expansion in Central Asia"],
    "part_of": ["Qing Expansion", "Central Asian Conflicts", "Manchu-Dzungar Rivalries"],
    "date_range": "1716-1727",
    "location": ["Xinjiang", "Mongolia", "Central Asia"],
    "background": {
      "causes": [
        "The Qing Empire's desire to consolidate its rule over the vast and strategically important region of Xinjiang and the surrounding Central Asian territories.",
        "The Dzungar Khanate’s expansionism and resistance to Qing authority in the region, which threatened Qing sovereignty in the western frontier.",
        "Long-standing tensions between the Manchu-led Qing Empire and the Dzungar Mongols, exacerbated by the former's efforts to control the Silk Road trade routes."
      ],
      "events_leading_up_to_war": [
        "The Dzungar Khanate, led by Galdan Tseren, expanded its territory in the early 1700s, encroaching into Qing-controlled regions.",
        "The Qing Empire, under Emperor Kangxi, had already begun a series of military campaigns to neutralize the Dzungar threat, but these efforts were unsuccessful.",
        "By the early 1710s, hostilities were open, with the Dzungars continuing their raids and provocations along the Qing frontier."
      ]
    },
    "result": {
      "general": "Qing victory",
      "treaty": "No formal treaty, but the Qing Empire solidified its control over the region",
      "territorial_changes": "The Qing Empire annexed the Dzungar Khanate’s territory, leading to the establishment of full Qing rule over Xinjiang and the eventual destruction of the Dzungar state.",
      "long_term_effects": "The collapse of the Dzungar Khanate marked a significant expansion of Qing territorial control into Central Asia, shaping China’s borders and influence in the region for centuries."
    },
    "belligerents": {
      "Qing_Empire": {
        "entities": ["Qing Empire", "Manchu Army", "Emperor Kangxi"],
        "allies": ["Mongol allies"]
      },
      "Dzungar_Khanate": {
        "entities": ["Dzungar Khanate", "Galdan Tseren", "Dzungar Mongols"],
        "allies": ["Various Central Asian Tribes"]
      }
    },
    "commanders_and_leaders": {
      "Qing_Empire": [
        "Emperor Kangxi",
        "Zuo Zongtang",
        "Fuk'anggan"
      ],
      "Dzungar_Khanate": [
        "Galdan Tseren",
        "Doran"
      ]
    },
    "strength": {
      "Qing_Empire": {
        "troops": "150,000+",
        "artillery": "Advanced firearms, cannons",
        "ships": "Limited naval forces, focus on land-based combat"
      },
      "Dzungar_Khanate": {
        "troops": "100,000+",
        "artillery": "Nomadic cavalry, traditional weaponry",
        "ships": "None"
      }
    },
    "casualties_and_losses": {
      "Qing_Empire": {
        "dead": "Around 10,000",
        "wounded": "Thousands, due to the difficult terrain and prolonged campaigns"
      },
      "Dzungar_Khanate": {
        "dead": "Up to 200,000 (including civilians)",
        "wounded": "Numerous, especially after the fall of the Dzungar Khanate"
      }
    },
    "major_battles": [
      {
        "name": "Battle of Zunhua",
        "date": "1716",
        "description": "A significant Qing victory against the Dzungar forces, which helped weaken Dzungar resistance in the region.",
        "outcome": "Qing victory, allowing for further military advances into Dzungar territory."
      },
      {
        "name": "Battle of Ulaanbaatar",
        "date": "1720",
        "description": "A decisive battle where the Qing forces finally broke the Dzungar resistance in Mongolia, marking the beginning of the end for the Khanate.",
        "outcome": "Qing victory, leading to the eventual collapse of Dzungar power."
      }
    ],
    "artifacts_and_evidence": {
      "texts": [
        {
          "name": "Kangxi’s Imperial Edicts",
          "type": "Imperial decrees",
          "location": "Qing Archives",
          "details": "Imperial decrees issued by Kangxi detailing military strategies and actions against the Dzungar Khanate."
        },
        {
          "name": "Dzungar Letters and Treaties",
          "type": "Dzungar diplomatic documents",
          "location": "Central Asian Archives",
          "details": "Correspondence between the Dzungar Khanate and various Central Asian tribes, offering insight into Dzungar politics and military strategy."
        }
      ],
      "archaeological_evidence": [
        {
          "type": "Dzungar weapons and fortifications",
          "description": "Artifacts from Dzungar fortifications, including weapons, coins, and other artifacts found in former Dzungar strongholds in Xinjiang."
        },
        {
          "type": "Qing military artifacts",
          "description": "Remains of Qing military fortifications, artillery, and armor found in battlefields across Xinjiang and Mongolia."
        }
      ],
      "historical_texts": [
        {
          "name": "The History of the Qing Dynasty by Li Xueqin",
          "type": "History book",
          "location": "National Library of China",
          "details": "A detailed historical account of the Qing Dynasty’s rise, military campaigns, and conquests in Central Asia."
        },
        {
          "name": "The Dzungar Khanate and its Fall by Peter Perdue",
          "type": "Historical analysis",
          "location": "Harvard University Press",
          "details": "A comprehensive history of the Dzungar Khanate, its political structure, and its defeat by the Qing Empire."
        }
      ]
    },
    "aftermath": {
      "political": [
        "The Qing Empire fully annexed the Dzungar Khanate’s territory, solidifying its control over Xinjiang and the Silk Road trade routes.",
        "The collapse of the Dzungar Khanate weakened Central Asia's ability to resist Qing and later Russian influence."
      ],
      "long_term_effects": [
        "The Qing expansion into Central Asia laid the foundation for modern China's borders, particularly in Xinjiang.",
        "The Dzungar Khanate’s destruction ended the last major nomadic power in Central Asia, contributing to the region’s eventual absorption into the Russian and Qing empires."
      ]
    },
    "historical_significance": {
      "military": [
        "The war marked a pivotal moment in Qing military history, showcasing their advanced military techniques and strategic planning.",
        "It represented one of the last large-scale campaigns against a nomadic Mongol power in Asia."
      ],
      "political": [
        "The annexation of the Dzungar Khanate helped to consolidate Qing power over Central Asia and cemented their control over Xinjiang, a region still disputed today."
      ],
      "cultural": [
        "The fall of the Dzungar Khanate led to significant demographic shifts in Xinjiang, with the displacement of Dzungar Mongols and the migration of Han Chinese settlers."
      ]
    }
  }
}
