{
  "Qing_Expansion_into_Tibet_1720": {
    "alternate_names": [
      "Qing Invasion of Tibet",
      "Qing-Tibetan War of 1720"
    ],
    "part_of": [
      "Qing Dynasty Expansion",
      "Dzungar-Qing Conflicts",
      "Tibetan Political Struggles"
    ],
    "date_range": "1720 CE",
    "location": [
      "Tibet",
      "Lhasa",
      "Himalayan Region"
    ],
    "background": {
      "causes": [
        "The Qing Dynasty sought to extend control over Tibet to counter the influence of the Dzungar Khanate.",
        "Tibet had been politically unstable following the death of the 6th Dalai Lama in 1706.",
        "The Dzungars, a Mongol power from Central Asia, invaded Tibet in 1717, deposing Qing-backed leaders.",
        "The Qing viewed the Dzungars as a major threat and sought to expel them from Tibet."
      ],
      "events_leading_up_to_war": [
        "The Dzungars installed their own ruler in Tibet and antagonized Tibetan Buddhist leaders.",
        "Tibetan monks and nobles requested Qing intervention to remove the Dzungars.",
        "Kangxi ordered a military expedition to Tibet in 1720, aiming to restore order and establish Qing influence."
      ]
    },
    "result": {
      "general": "Qing Dynasty victory",
      "territorial_changes": "Tibet became a Qing protectorate, with a Qing-backed government in Lhasa."
    },
    "belligerents": {
      "Qing_Dynasty": {
        "entities": ["Qing Imperial Army", "Tibetan Loyalists"],
        "allies": ["Tibetan Buddhist Monasteries"]
      },
      "Dzungar_Khanate": {
        "entities": ["Dzungar Mongol Forces"],
        "allies": ["Local Tibetan factions opposed to Qing rule"]
      }
    },
    "commanders_and_leaders": {
      "Qing_Dynasty": [
        "Emperor Kangxi",
        "Yinzhi, Prince Xun",
        "Erentei",
        "Fuheng"
      ],
      "Dzungar_Khanate": [
        "Tsewang Rabtan",
        "Lhabzang Khan (previous Tibetan ruler, killed earlier)"
      ]
    },
    "strength": {
      "Qing_Dynasty": {
        "troops": "10,000+",
        "weapons": "Firearms, cavalry, traditional Qing military formations"
      },
      "Dzungar_Khanate": {
        "troops": "5,000+",
        "weapons": "Mongol cavalry, bows, spears, limited firearms"
      }
    },
    "casualties_and_losses": {
      "Qing_Dynasty": {
        "dead": "Unknown but limited",
        "wounded": "Several hundred"
      },
      "Dzungar_Khanate": {
        "dead": "Thousands",
        "wounded": "Unknown",
        "captured": "Many Dzungar forces executed or expelled from Tibet"
      }
    },
    "major_battles": [
      {
        "name": "Battle of Lhasa",
        "date": "1720 CE",
        "description": "A decisive battle where Qing forces pushed into Lhasa, expelling the Dzungars and establishing control.",
        "outcome": "Qing victory, securing the city for the Qing-backed Tibetan rulers."
      }
    ],
    "artifacts_and_evidence": {
      "texts": [
        {
          "name": "Qing Imperial Records",
          "type": "Historical record",
          "location": "Chinese National Archives",
          "details": "Official Qing government documents detailing the campaign."
        },
        {
          "name": "Tibetan Monastic Writings",
          "type": "Religious and political records",
          "location": "Tibetan monasteries",
          "details": "Documents detailing the role of Tibetan Buddhist leaders in requesting Qing intervention."
        }
      ],
      "archaeological_evidence": [
        {
          "type": "Qing military artifacts",
          "description": "Qing weapons and armor discovered in Tibet."
        },
        {
          "type": "Dzungar fortifications",
          "description": "Ruins of Dzungar defensive structures found near Lhasa."
        }
      ]
    },
    "aftermath": {
      "political": [
        "Tibet was placed under Qing protection, with a Qing-appointed regent overseeing governance.",
        "The Dalai Lama was reinstated under Qing supervision, cementing the Qing role in Tibetan affairs.",
        "The Qing installed a garrison in Lhasa to ensure continued control over the region."
      ],
      "long_term_effects": [
        "The Qing-Tibetan relationship became more structured, with the empire overseeing Tibetan affairs for over a century.",
        "Tibet remained a Qing protectorate, preventing other Central Asian powers from taking control.",
        "The precedent of Qing intervention in Tibet influenced later Chinese claims to the region."
      ]
    },
    "historical_significance": {
      "military": [
        "Demonstrated Qing military capabilities in high-altitude warfare.",
        "Weakened the Dzungar Khanate, leading to its eventual downfall in later Qing campaigns."
      ],
      "political": [
        "Strengthened Qing authority over Tibet, establishing a model of indirect rule.",
        "Helped consolidate Qing control over China's western frontiers."
      ],
      "cultural": [
        "Qing intervention reinforced the role of the Dalai Lama in Tibetan politics.",
        "Led to increased Chinese-Tibetan interactions, influencing administration and governance."
      ]
    }
  }
}
